app/Controllers/Film.php

    }

    //ambil data lama
    $film = $this->film->find($this->request->getPost('id'));
---
SELECT *
FROM `film`
WHERE `film`.`id` = '10'

        $data['cover'] = $imageName;
    }

    $this->film->save($data);
---
UPDATE `film` SET `nama_film` = 'Evil dead Rise', `id_genre` = '7', `duration` = '2 Jam 35 menit', `cover` = '1688218088_d71a932cfb2c1afaafd5.jpg'
WHERE `film`.`id` IN ('10')

    public function destroy($id)
    {
        $decryptedId = decryptUrl($id);
        $this->film->delete($decryptedId);
---
DELETE FROM `film`
WHERE `id` IN ('6')