app/Models/FilmModel.php

SELECT *
FROM `film`
JOIN `genre` ON `film`.`id_genre` = `genre`.`id_genre`
---
public function getAllData()
{
   return $this->join('genre', 'film.id_genre = genre.id_genre')->findAll();

SELECT *
FROM `film`
WHERE `film`.`id` = '10'
---
public function getDataById($id)
{
   return $this->find($id);