app/Models/GenreModel.php

    public function getAllGenre()
    {
     return $this->findAll();
---
SELECT *
FROM `genre`